alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "dma2d.h"
#include "eth.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "quadspi.h"
#include "rtc.h"
#include "sai.h"
#include "sdmmc.h"
#include "spdifrx.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_audio.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "ff.h"
#include "arm_math.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
FATFS SDFatFs;

#define AUDIO_BUFFER_SIZE   8192
#define AUDIO_HALF_BUFFER   (AUDIO_BUFFER_SIZE / 2)
FIL WavFile;
uint8_t AudioBuffer[AUDIO_BUFFER_SIZE];
volatile uint32_t AudioRemainingBytes = 0;
volatile uint8_t  AudioPlaying = 0;
volatile uint8_t  HalfBufferNeedsFill = 0;
volatile uint8_t  FullBufferNeedsFill = 0;
volatile uint8_t AudioTrackFinished = 0;
volatile uint8_t EQEnabled = 1;
volatile uint8_t EchoEnabled = 0;
volatile uint8_t echoResetPending = 0;
volatile uint8_t ReverbEnabled = 0;
volatile uint8_t reverbResetPending = 0;

extern volatile uint8_t AudioVolume;

#define FFT_SIZE 1024
#define FFT_BANDS 16
#define EQ_BLOCK_SIZE 1024
#define EQ_BAND_COUNT 5
#define BIQUAD_COEFFS_PER_STAGE 5
#define BIQUAD_STATE_PER_STAGE 4
#define EQ_MAX_HEADROOM_DB 6.0f
#define EQ_LIMITER_THRESHOLD 32000.0f
#define EQ_LIMITER_RELEASE 0.05f

#define ECHO_BUFFER_ADDRESS 0xC0100000U
#define ECHO_MAX_SAMPLE_RATE 48000U
#define ECHO_MAX_DELAY_MS 500U
#define ECHO_DELAY_MS 280U
#define ECHO_CHANNEL_COUNT 2U
#define ECHO_MIX 0.28f
#define ECHO_FEEDBACK 0.37f
#define ECHO_MAX_DELAY_SAMPLES \
    ((ECHO_MAX_SAMPLE_RATE * ECHO_MAX_DELAY_MS) / 1000U)
#define ECHO_BUFFER_FLOAT_COUNT \
    (ECHO_MAX_DELAY_SAMPLES * ECHO_CHANNEL_COUNT)

#define REVERB_BUFFER_ADDRESS 0xC0140000U
#define REVERB_CHANNEL_COUNT 2U
#define REVERB_COMB_COUNT 4U
#define REVERB_ALLPASS_COUNT 2U
#define REVERB_MAX_SAMPLE_RATE 48000U
#define REVERB_COMB_MAX_DELAY_MS 50U
#define REVERB_ALLPASS_MAX_DELAY_MS 8U
#define REVERB_COMB_MAX_SAMPLES \
    ((REVERB_MAX_SAMPLE_RATE * REVERB_COMB_MAX_DELAY_MS) / 1000U)
#define REVERB_ALLPASS_MAX_SAMPLES \
    ((REVERB_MAX_SAMPLE_RATE * REVERB_ALLPASS_MAX_DELAY_MS) / 1000U)
#define REVERB_MIX 0.22f
#define REVERB_FEEDBACK 0.72f
#define REVERB_DAMPING 0.25f
#define REVERB_ALLPASS_GAIN 0.50f

float32_t fftBands[FFT_BANDS];
float32_t fftBandsSmoothed[FFT_BANDS];
float32_t fftInput[FFT_SIZE];
float32_t fftOutput[FFT_SIZE];
float32_t fftMagnitude[FFT_SIZE / 2];
float32_t hannWindow[FFT_SIZE];

static const float32_t eqBandFrequencies[EQ_BAND_COUNT] =
{
    100.0f,
    300.0f,
    1000.0f,
    3000.0f,
    8000.0f
};

float32_t eqBandGainsDB[EQ_BAND_COUNT] =
{
    0.0f,   // 100 Hz
    0.0f,   // 300 Hz
    0.0f,   // 1 kHz
    0.0f,   // 3 kHz
    0.0f    // 8 kHz
};

volatile float32_t eqRequestedGainsDB[EQ_BAND_COUNT] =
{
    0.0f,
    0.0f,
    0.0f,
    0.0f,
    0.0f
};
volatile uint8_t eqUpdatePending = 0;
float32_t eqSampleRate = 48000.0f;
float32_t eqPreampGain = 1.0f;
float32_t eqLimiterGain = 1.0f;

float32_t eqCoeffs[EQ_BAND_COUNT * BIQUAD_COEFFS_PER_STAGE];
float32_t eqStateLeft[EQ_BAND_COUNT * BIQUAD_STATE_PER_STAGE];
float32_t eqStateRight[EQ_BAND_COUNT * BIQUAD_STATE_PER_STAGE];
float32_t eqLeftBuffer[EQ_BLOCK_SIZE];
float32_t eqRightBuffer[EQ_BLOCK_SIZE];

static float32_t *const echoBuffer =
    (float32_t *)ECHO_BUFFER_ADDRESS;
static uint32_t echoIndex = 0;
static uint32_t echoDelaySamples = 1;

typedef struct
{
    float32_t *buffer;
    uint32_t length;
    uint32_t index;
    float32_t dampingState;
} ReverbDelayLine;

static float32_t *const reverbBuffer =
    (float32_t *)REVERB_BUFFER_ADDRESS;
static ReverbDelayLine
    reverbComb[REVERB_CHANNEL_COUNT][REVERB_COMB_COUNT];
static ReverbDelayLine
    reverbAllpass[REVERB_CHANNEL_COUNT][REVERB_ALLPASS_COUNT];

arm_rfft_fast_instance_f32 fftInstance;
arm_biquad_casd_df1_inst_f32 eqLeft;
arm_biquad_casd_df1_inst_f32 eqRight;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram);

uint8_t WavPlayer_Start(const char *filename);
void WavPlayer_FillHalf(uint8_t *half);

void AudioFFT_Process(uint8_t *audioData);

void AudioEQ_Init(float32_t sampleRate);
void AudioEQ_Process(uint8_t *audioData);
void AudioEQ_SetBandGain(uint8_t band, float32_t gainDB);
void AudioEcho_SetEnabled(uint8_t enabled);
uint8_t AudioEcho_IsEnabled(void);
void AudioReverb_SetEnabled(uint8_t enabled);
uint8_t AudioReverb_IsEnabled(void);
static void AudioEQ_CalculateCoefficients(void);
static void AudioEQ_UpdatePreampGain(void);
static void AudioEQ_ApplyPendingGains(void);
static void AudioEQ_ApplyLimiter(void);
static void AudioEcho_Init(float32_t sampleRate);
static void AudioEcho_Reset(void);
static void AudioEcho_Process(void);
static void AudioReverb_Init(float32_t sampleRate);
static void AudioReverb_Reset(void);
static void AudioReverb_Process(void);
static float32_t AudioReverb_ProcessComb(
    ReverbDelayLine *line,
    float32_t input
);
static float32_t AudioReverb_ProcessAllpass(
    ReverbDelayLine *line,
    float32_t input
);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

