alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
void AudioEQ_SetBandGain(uint8_t band, float32_t gainDB)
{
    if (band >= EQ_BAND_COUNT)
    {
        return;
    }

    if (gainDB < -12.0f)
    {
        gainDB = -12.0f;
    }
    else if (gainDB > 12.0f)
    {
        gainDB = 12.0f;
    }

    eqRequestedGainsDB[band] = gainDB;
    eqUpdatePending = 1;
}

static void AudioEQ_ApplyPendingGains(void)
{
    if (!eqUpdatePending)
    {
        return;
    }

    eqUpdatePending = 0;

    for (uint32_t band = 0; band < EQ_BAND_COUNT; band++)
    {
        eqBandGainsDB[band] = eqRequestedGainsDB[band];
    }

    AudioEQ_UpdatePreampGain();
    AudioEQ_CalculateCoefficients();
}

static void AudioEQ_ApplyLimiter(void)
{
    float32_t peak = 0.0f;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t leftPeak = fabsf(eqLeftBuffer[i]);
        float32_t rightPeak = fabsf(eqRightBuffer[i]);

        if (leftPeak > peak)
        {
            peak = leftPeak;
        }

        if (rightPeak > peak)
        {
            peak = rightPeak;
        }
    }

    float32_t targetGain = 1.0f;

    if (peak > EQ_LIMITER_THRESHOLD)
    {
        targetGain = EQ_LIMITER_THRESHOLD / peak;
    }

    if (targetGain < eqLimiterGain)
    {
        eqLimiterGain = targetGain;
    }
    else
    {
        eqLimiterGain +=
            EQ_LIMITER_RELEASE * (targetGain - eqLimiterGain);
    }

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] *= eqLimiterGain;
        eqRightBuffer[i] *= eqLimiterGain;
    }
}

void AudioEcho_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (EchoEnabled != newState)
    {
        EchoEnabled = newState;
        echoResetPending = 1U;
    }
}

uint8_t AudioEcho_IsEnabled(void)
{
    return EchoEnabled;
}

static void AudioEcho_Reset(void)
{
    echoIndex = 0U;

    memset(
        echoBuffer,
        0,
        ECHO_BUFFER_FLOAT_COUNT * sizeof(float32_t)
    );
}

static void AudioEcho_Init(float32_t sampleRate)
{
    uint32_t requestedSamples =
        (uint32_t)((sampleRate * ECHO_DELAY_MS) / 1000.0f);

    if (requestedSamples < 1U)
    {
        requestedSamples = 1U;
    }
    else if (requestedSamples > ECHO_MAX_DELAY_SAMPLES)
    {
        requestedSamples = ECHO_MAX_DELAY_SAMPLES;
    }

    echoDelaySamples = requestedSamples;
    AudioEcho_Reset();
}

static void AudioEcho_Process(void)
{
    const float32_t dryMix = 1.0f - ECHO_MIX;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        uint32_t bufferIndex = echoIndex * ECHO_CHANNEL_COUNT;

        float32_t dryLeft = eqLeftBuffer[i];
        float32_t dryRight = eqRightBuffer[i];
        float32_t delayedLeft = echoBuffer[bufferIndex];
        float32_t delayedRight = echoBuffer[bufferIndex + 1U];

        /* y[n] = (1-M)x[n] + M d[n] */
        eqLeftBuffer[i] =
            dryMix * dryLeft + ECHO_MIX * delayedLeft;
        eqRightBuffer[i] =
            dryMix * dryRight + ECHO_MIX * delayedRight;

        /* b[n] = x[n] + F d[n] */
        echoBuffer[bufferIndex] =
            dryLeft + ECHO_FEEDBACK * delayedLeft;
        echoBuffer[bufferIndex + 1U] =
            dryRight + ECHO_FEEDBACK * delayedRight;

        echoIndex++;

        if (echoIndex >= echoDelaySamples)
        {
            echoIndex = 0U;
        }
    }
}

void AudioReverb_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (ReverbEnabled != newState)
    {
        ReverbEnabled = newState;
        reverbResetPending = 1U;
    }
}

uint8_t AudioReverb_IsEnabled(void)
{
    return ReverbEnabled;
}

static void AudioReverb_Reset(void)
{
    const uint32_t combFloatCount =
        REVERB_CHANNEL_COUNT *
        REVERB_COMB_COUNT *
        REVERB_COMB_MAX_SAMPLES;
    const uint32_t allpassFloatCount =
        REVERB_CHANNEL_COUNT *
        REVERB_ALLPASS_COUNT *
        REVERB_ALLPASS_MAX_SAMPLES;

    memset(
        reverbBuffer,
        0,
        (combFloatCount + allpassFloatCount) * sizeof(float32_t)
    );

    for (uint32_t channel = 0U;
         channel < REVERB_CHANNEL_COUNT;
         channel++)
    {
        for (uint32_t stage = 0U;
             stage < REVERB_COMB_COUNT;
             stage++)
        {
            reverbComb[channel][stage].index = 0U;
            reverbComb[channel][stage].dampingState = 0.0f;
        }

        for (uint32_t stage = 0U;
             stage < REVERB_ALLPASS_COUNT;
             stage++)
        {
            reverbAllpass[channel][stage].index = 0U;
            reverbAllpass[channel][stage].dampingState = 0.0f;
        }
    }
}

static void AudioReverb_Init(float32_t sampleRate)
{
    static const float32_t combDelayMs
        [REVERB_CHANNEL_COUNT][REVERB_COMB_COUNT] =
    {
        {29.7f, 37.1f, 41.1f, 43.7f},
        {30.9f, 38.3f, 42.3f, 44.9f}
    };
    static const float32_t allpassDelayMs
        [REVERB_CHANNEL_COUNT][REVERB_ALLPASS_COUNT] =
    {
        {5.0f, 1.7f},
        {5.5f, 2.1f}
    };

    uint32_t allpassBase =
        REVERB_CHANNEL_COUNT *
        REVERB_COMB_COUNT *
        REVERB_COMB_MAX_SAMPLES;

    for (uint32_t channel = 0U;
         channel < REVERB_CHANNEL_COUNT;
         channel++)
    {
        for (uint32_t stage = 0U;
             stage < REVERB_COMB_COUNT;
             stage++)
        {
            uint32_t slot =
                channel * REVERB_COMB_COUNT + stage;
            uint32_t length = (uint32_t)(
                sampleRate * combDelayMs[channel][stage] / 1000.0f
            );

            if (length < 1U)
            {
                length = 1U;
            }
            else if (length > REVERB_COMB_MAX_SAMPLES)
            {
                length = REVERB_COMB_MAX_SAMPLES;
            }

            reverbComb[channel][stage].buffer =
                &reverbBuffer[slot * REVERB_COMB_MAX_SAMPLES];
            reverbComb[channel][stage].length = length;
        }

        for (uint32_t stage = 0U;
             stage < REVERB_ALLPASS_COUNT;
             stage++)
        {
            uint32_t slot =
                channel * REVERB_ALLPASS_COUNT + stage;
            uint32_t length = (uint32_t)(
                sampleRate * allpassDelayMs[channel][stage] / 1000.0f
            );

            if (length < 1U)
            {
                length = 1U;
            }
            else if (length > REVERB_ALLPASS_MAX_SAMPLES)
            {
                length = REVERB_ALLPASS_MAX_SAMPLES;
            }

            reverbAllpass[channel][stage].buffer =
                &reverbBuffer[
                    allpassBase +
                    slot * REVERB_ALLPASS_MAX_SAMPLES
                ];
            reverbAllpass[channel][stage].length = length;
        }
    }

