alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
    AudioReverb_Reset();
}

static float32_t AudioReverb_ProcessComb(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* f[n] = (1-D)d[n] + D f[n-1] */
    line->dampingState =
        (1.0f - REVERB_DAMPING) * delayed +
        REVERB_DAMPING * line->dampingState;

    /* b[n] = x[n] + G f[n] */
    line->buffer[line->index] =
        input + REVERB_FEEDBACK * line->dampingState;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return delayed;
}

static float32_t AudioReverb_ProcessAllpass(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* y[n] = -G x[n] + d[n] */
    float32_t output =
        -REVERB_ALLPASS_GAIN * input + delayed;

    /* b[n] = x[n] + G y[n] */
    line->buffer[line->index] =
        input + REVERB_ALLPASS_GAIN * output;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return output;
}

static void AudioReverb_Process(void)
{
    for (uint32_t i = 0U; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t dry[REVERB_CHANNEL_COUNT] =
        {
            eqLeftBuffer[i],
            eqRightBuffer[i]
        };
        float32_t wet[REVERB_CHANNEL_COUNT] = {0.0f, 0.0f};

        for (uint32_t channel = 0U;
             channel < REVERB_CHANNEL_COUNT;
             channel++)
        {
            for (uint32_t stage = 0U;
                 stage < REVERB_COMB_COUNT;
                 stage++)
            {
                wet[channel] += AudioReverb_ProcessComb(
                    &reverbComb[channel][stage],
                    dry[channel]
                );
            }

            wet[channel] /= (float32_t)REVERB_COMB_COUNT;

            for (uint32_t stage = 0U;
                 stage < REVERB_ALLPASS_COUNT;
                 stage++)
            {
                wet[channel] = AudioReverb_ProcessAllpass(
                    &reverbAllpass[channel][stage],
                    wet[channel]
                );
            }
        }

        /* output[n] = dry[n] + M wet[n] */
        eqLeftBuffer[i] =
            dry[0] + REVERB_MIX * wet[0];
        eqRightBuffer[i] =
            dry[1] + REVERB_MIX * wet[1];
    }
}

void AudioEQ_Process(uint8_t *audioData)
{
    if (echoResetPending)
    {
        echoResetPending = 0U;
        AudioEcho_Reset();
    }

    if (reverbResetPending)
    {
        reverbResetPending = 0U;
        AudioReverb_Reset();
    }

    if (!EQEnabled && !EchoEnabled && !ReverbEnabled)
    {
        return;
    }

    AudioEQ_ApplyPendingGains();

    int16_t *samples =
        (int16_t *)audioData;
    float32_t inputGain =
        EQEnabled ? eqPreampGain : 1.0f;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] =
            (float32_t)samples[2 * i] * inputGain;

        eqRightBuffer[i] =
            (float32_t)samples[2 * i + 1] * inputGain;
    }

    if (EQEnabled)
    {
        arm_biquad_cascade_df1_f32(
            &eqLeft,
            eqLeftBuffer,
            eqLeftBuffer,
            EQ_BLOCK_SIZE
        );

        arm_biquad_cascade_df1_f32(
            &eqRight,
            eqRightBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    if (EchoEnabled)
    {
        AudioEcho_Process();
    }

    if (ReverbEnabled)
    {
        AudioReverb_Process();
    }

    AudioEQ_ApplyLimiter();

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t left = eqLeftBuffer[i];
        float32_t right = eqRightBuffer[i];

        if (left > 32767.0f)
            left = 32767.0f;

        if (left < -32768.0f)
            left = -32768.0f;

        if (right > 32767.0f)
            right = 32767.0f;

        if (right < -32768.0f)
            right = -32768.0f;

        samples[2 * i] =
            (int16_t)left;

        samples[2 * i + 1] =
            (int16_t)right;
    }
}

void AudioFFT_Process(uint8_t *audioData)
{
    int16_t *samples = (int16_t *)audioData;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        int32_t left  = samples[2 * i];
        int32_t right = samples[2 * i + 1];

        fftInput[i] = ((float32_t)left + (float32_t)right) * 0.5f;
    }

    float32_t mean = 0.0f;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        mean += fftInput[i];
    }

    mean /= FFT_SIZE;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] -= mean;
    }

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] *= hannWindow[i];
    }

    arm_rfft_fast_f32(
        &fftInstance,
        fftInput,
        fftOutput,
        0
    );

    fftMagnitude[0] = fabsf(fftOutput[0])/ FFT_SIZE;

    for (uint32_t k = 1; k < FFT_SIZE / 2; k++)
    {
        float32_t real = fftOutput[2 * k];
        float32_t imag = fftOutput[2 * k + 1];

        fftMagnitude[k] =
            sqrtf(real * real + imag * imag)/ FFT_SIZE;
    }

    uint32_t maxBin = 1;
    float32_t maxMagnitude = fftMagnitude[1];

    for (uint32_t k = 2; k < FFT_SIZE / 2; k++)
    {
        if (fftMagnitude[k] > maxMagnitude)
        {
            maxMagnitude = fftMagnitude[k];
            maxBin = k;
        }
    }
    static const uint16_t bandEdges[FFT_BANDS + 1] =
    {
        1,
        2,
        3,
        4,
        6,
        9,
        13,
        19,
        28,
        41,
        60,
        88,
        129,
        189,
        277,
        405,
        511
    };

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t sum = 0.0f;

        uint32_t startBin = bandEdges[band];
        uint32_t endBin   = bandEdges[band + 1];

        for (uint32_t k = startBin; k < endBin; k++)
        {
            sum += fftMagnitude[k];
        }

        uint32_t count = endBin - startBin;

        if (count > 0)
        {
            fftBands[band] = sum / (float32_t)count;
        }
        else
        {
            fftBands[band] = 0.0f;
        }
    }
    float32_t maxBand = 1.0f;

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        if (fftBands[band] > maxBand)
        {
            maxBand = fftBands[band];
        }
    }

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t normalized =
            (fftBands[band] / maxBand) * 100.0f;

        if (normalized > 100.0f)
        {
            normalized = 100.0f;
        }

